---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TileBrickColor
source: html/1676008f-ab31-ca7c-3a51-9cce2bc889c6.htm
---
# Autodesk.Revit.DB.Visual.Tile.TileBrickColor Property

The property labeled "Tile Color" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TileBrickColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.